{
  "chapters": [
    [
      {
        "type": "text",
        "data": [
          "Истина и ложь.",
          "В информатике существуют такие понятия как 'истина' и 'ложь'.",
          "Если утверждение верное - это истина.",
          "Например: 'Дети любят играть' - это истина, 'Морская вода - соленая' - это истина.",
          "Если утверждение неверное - это ложь.",
          "Например: '2 плюс 2 равно 5' - это ложь, 'Лондон - столица России' - это ложь."
        ]
      },
      {
        "type": "text",
        "data": [
          " "
        ]
      },
      {
        "type": "text",
        "data": [
          "Цепочка.",
          "Цепочка - это последовательность объектов, или действий.",
          "Например: правильная цепочка действий 'Открыл дверь - зашел в класс'"
        ]
      }
    ],
    [
      {
        "type": "text",
        "data": [
          "Если - то - иначе",
          "В информатике есть такое понятие как условие.",
          "Допустим, у нас есть результат который может произойти только в том случае если выполнится условие, например:",
          "'Если завтра будет тепло, то я пойду гулять'",
          "То есть действие после 'то' произойдет только в том случае если условие что 'завтра будет тепло' выполнится",
          "Но что же нам делать если мы хотим что-то сделать если условие не произойдет?",
          "Для этого используется конструкция если-то-иначе (if-then-else), например",
          "'Если завтра будет тепло, то я пойду гулять, иначе буду играть на компьютере'"
        ]
      }
    ],
    [
      {
        "type": "text",
        "data": [
          "Высказывание со слово «НЕ» истинно тогда, когда такое же высказывание без слова «не» ложно, и наоборот.",
          "Например: Летом идет снег - ложно, летом НЕ идет снег - истина",
          "Высказывание со словом «И» состоит из двух высказываний и истинно тогда, когда истинные обе «половинки».",
          "Например: Зимой холодно - истина, летом жарко - истина, зимой холодно И летом жарко - тоже истина",
          "Высказывание со словом «ИЛИ» тоже состоит из двух высказываний, но оно истинно тогда, когда истинна хотя бы одна «половина».",
          "Например: Зимой жарко - ложь, летом жарко - истина, Зимой жарко ИЛИ летом жарко - истина"
        ]
      }
    ]
  ]
}
